## Agenda:

    As a Data Scientist/Analyst, you will always need to first ingest and read data in order to perform analysis.
    


### Learn Data Analysis using Pandas and Python

    Pyhton Pandas provides powerful tools.
    
    
* Various data formats that you may encounter:

    - CSV
    
    - Tab Separated
    
    - Pipe Delimited
    
    - Json
    
    - And many more

Resources:

The data files used:

1. https://datatables.net/extensions/buttons/examples/flash/tsv.html
2. https://data-gov.tw.rpi.edu/wiki/CSV_files_use_delimiters_other_than_commas

> (note: if the file links change, please feel free to use any pipe-delimited or tab separated file. )

Read_table documentation: https://pandas.pydata.org/pandas-docs/version/0.21/generated/pandas.read_table.html

---

In [1]:
#Import Library

import pandas as pd
import os

In [2]:
# Path

file = os.path.join('Resources', 'employees.tsv')

In [3]:
# Read the CSV Separated 

employee = pd.read_table(file)
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

#### Load a Pipe Separated Data

In [4]:
# File URL Location

url = 'https://www.nrc.gov/reading-rm/doc-collections/event-status/reactor-status/2009/2009PowerStatus.txt'

In [5]:
# Read the Pipe Data
# User ``sep`` parameter 

df = pd.read_table(url, sep='|')
df.head()

     ReportDt                Unit  Power
0  12/31/2009  Arkansas Nuclear 1    100
1  12/31/2009  Arkansas Nuclear 2    100
2  12/31/2009     Beaver Valley 1    100
3  12/31/2009     Beaver Valley 2    100
4  12/31/2009         Braidwood 1    100

In [6]:
# Store data into CSV

df.to_csv('Resources/pipedata.csv')